# mySQL | Python

## Librerías a utilizar

In [3]:
## Instalar pymysql para poder conectarnos desde Python
!pip install pymysql
import pandas as pd
import pymysql

Requirement already satisfied: pymysql in /home/eleana/Documents/git/practica/pp12021grupo2_a1-pp12021grupo2_a1/jupyter/lib/python3.8/site-packages (1.0.2)

## Realizar la conexion a la BBDD employees

In [4]:
try:
    conexion = pymysql.connect(host='localhost',
                               user='root',
                               password='root',
                               db='employees')
    print("Conexión correcta")
except (pymysql.err.OperationalError, pymysql.err.InternalError) as e:
    print("Ocurrió un error al conectar: ", e)

Conexión correcta

______
## Obtenemos los datos de la tabla employees

In [5]:
try:
    with conexion.cursor() as cursor:
        cursor.execute("SELECT * FROM employees;") # En este caso no necesitamos limpiar ningún dato
        print("Se realizó la consulta")
        employees = cursor.fetchall()
except:
    print('No se pudo realizar la consulta')

Se realizó la consulta

In [6]:
## Convertimos en DataFrame y obtenemos las cinco primeras filas
emp = "SELECT emp_no AS ID_empleado, birth_date AS Nacimiento, first_name AS Nombre, last_name AS Apellido, gender AS Genero, hire_date AS Fecha_Contratacion FROM employees ;"
df_emp = pd.read_sql_query(emp, conexion)
df_emp.head()

   ID_empleado  Nacimiento     Nombre  Apellido Genero Fecha_Contratacion
0        10001  1953-09-02     Georgi   Facello      M         1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F         1985-11-21
2        10003  1959-12-03      Parto   Bamford      M         1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M         1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M         1989-09-12

______
## Obtener los datos completos de los departamentos

In [7]:
try:
    with conexion.cursor() as cursor:
        cursor.execute("SELECT * FROM departments;") # En este caso no necesitamos limpiar ningún dato
        print("Se realizó la consulta")
        # Con fetchall traemos todas las filas
        dpt = cursor.fetchall()
except:
    print('No se pudo realizar la consulta')

Se realizó la consulta

In [8]:
dpt = "SELECT * FROM departments ;"
df_dpt = pd.read_sql_query(dpt, conexion)
df_dpt.head()

  dept_no         dept_name
0    d010  Ciencia de Datos
1    d009  Customer Service
2    d005       Development
3    d002           Finance
4    d003   Human Resources

____
## Obtenemos los datos de la tabla employees que sean mujeres

In [9]:
try:
    with conexion.cursor() as cursor:
        cursor.execute("SELECT * FROM employees WHERE gender ='F';") 
        # Con fetchall traemos todas las filas
        employees = cursor.fetchall()
        print("Se realizó la consulta")
except:
    print('No se pudo realizar la consulta')

Se realizó la consulta

In [10]:
emp_F = "SELECT emp_no AS ID_empleado, first_name AS Nombre, gender AS Genero FROM employees WHERE gender ='F';"
df_F = pd.read_sql_query(emp_F, conexion)
df_F.head()

   ID_empleado     Nombre Genero
0        10002    Bezalel      F
1        10006     Anneke      F
2        10007    Tzvetan      F
3        10009     Sumant      F
4        10010  Duangkaew      F

____
## Obtener la cantidad de empleados de sexo femenino.

In [11]:
try:
    with conexion.cursor() as cursor:
        cursor.execute("SELECT COUNT(*) FROM employees WHERE gender ='F';")
        # Con fetchall traemos todas las filas
        employees = cursor.fetchone()
        print("\nLa cantidad de empleadas mujeres son: ", employees)
except:
    print('No se pudo realizar la consulta')

La cantidad de empleadas mujeres son:  (120051,)

_____
## Obtener los empleados que son o han sido "Staff". Recordar que es una consulta multi tablas.

In [12]:
try:
    with conexion.cursor() as cursor:
        cursor.execute("SELECT e.emp_no, birth_date, first_name, last_name, gender, hire_date, title FROM employees AS e JOIN titles AS t ON e.emp_no = t.emp_no WHERE t.title = 'Staff';")
        # Con fetchall traemos todas las filas
        employees = cursor.fetchall()
        print("Se realizó la consulta")
except:
    print('No se pudo realizar la consulta')

Se realizó la consulta

In [13]:
emp_Staff = "SELECT e.emp_no, birth_date, first_name, last_name, gender, hire_date, title FROM employees AS e JOIN titles AS t ON e.emp_no = t.emp_no WHERE t.title = 'Staff';"
df_emp_Staff = pd.read_sql_query(emp_Staff, conexion)
df_emp_Staff.head()

   emp_no  birth_date first_name    last_name gender   hire_date  title
0   10002  1964-06-02    Bezalel       Simmel      F  1985-11-21  Staff
1   10005  1955-01-21    Kyoichi     Maliniak      M  1989-09-12  Staff
2   10007  1957-05-23    Tzvetan    Zielinski      F  1989-02-10  Staff
3   10011  1953-11-07       Mary        Sluis      F  1990-01-22  Staff
4   10016  1961-05-02   Kazuhito  Cappelletti      M  1995-01-27  Staff

____
## Agregar el departamento Ciencia de Datos

In [14]:
try:
    with conexion.cursor() as cursor:
        consulta = "INSERT INTO departments (dept_no, dept_name) VALUES (%s, %s);"
        cursor.execute(consulta, ('d010','Ciencia de Datos'))
    conexion.commit()
    print("El dato se insertó correctamente")
except:
    print('No se pudo cargar el dato')

No se pudo cargar el dato

In [15]:
dpt_DS = "SELECT dept_no, dept_name FROM departments WHERE dept_name = 'Ciencia de Datos'; "
df_dpt_DS = pd.read_sql_query(dpt_DS, conexion)
df_dpt_DS.head()

  dept_no         dept_name
0    d010  Ciencia de Datos

______
## Insertamos un valor en la tabla employees

In [16]:
try:
    with conexion.cursor() as cursor:
        consulta = "INSERT INTO employees(emp_no, birth_date, first_name, last_name, gender, hire_date) VALUES (%s, %s, %s, %s, %s, %s);"
        # Podemos llamar muchas veces a .execute con datos distintos
        cursor.execute(consulta, ('00001', '1985-01-01','Pepe', 'Pe', 'M', '1985-01-01'))
    conexion.commit()
    print("El dato se ingresó correctamente")
except:
    print('No se pudo cargar el dato')

El dato se ingresó correctamente

In [17]:
emp_Pepe = "SELECT emp_no, birth_date, first_name, last_name, gender, hire_date FROM employees WHERE emp_no = '00001'; "
df_F = pd.read_sql_query(emp_Pepe, conexion)
df_F.head()

   emp_no  birth_date first_name last_name gender   hire_date
0       1  1985-01-01       Pepe        Pe      M  1985-01-01

___

## Borrar el empleado "Pepe"

In [18]:
try:
    with conexion.cursor() as cursor:
        consulta = "DELETE FROM employees WHERE first_name = %s;"
        first_name = 'Pepe'
        # Podemos llamar muchas veces a .execute con datos distintos
        cursor.execute(consulta, (first_name))
    conexion.commit()
    print("El dato se eliminó correctamente")
except:
    print('No se pudo eliminar el dato')

El dato se eliminó correctamente

In [19]:
emp_PepeDS = "SELECT * FROM employees WHERE first_name = 'Pepe'; "
df_emp_PepeDS = pd.read_sql_query(emp_PepeDS, conexion)
df_emp_PepeDS.head()

Empty DataFrame
Columns: [emp_no, birth_date, first_name, last_name, gender, hire_date]
Index: []

_____
## Obtener el promedio de salarios por departamento.

In [20]:
try:
    with conexion.cursor() as cursor:
        consulta = "SELECT departments.dept_name as nombre_dpto, AVG(salaries.salary) as promedio_salario FROM departments  LEFT JOIN dept_emp ON dept_emp.dept_no = departments.dept_no LEFT JOIN employees ON dept_emp.emp_no = employees.emp_no LEFT JOIN salaries ON salaries.emp_no = employees.emp_no GROUP BY departments.dept_name;"
        cursor.execute(consulta)
        employees = cursor.fetchall()
        print("Se realizó la consulta")
except:
    print('No se pudo realizar la consulta')

Se realizó la consulta

In [21]:
emp_avgSalary = "SELECT departments.dept_name as nombre_dpto, AVG(salaries.salary) as promedio_salario FROM departments  LEFT JOIN dept_emp ON dept_emp.dept_no = departments.dept_no LEFT JOIN employees ON dept_emp.emp_no = employees.emp_no LEFT JOIN salaries ON salaries.emp_no = employees.emp_no GROUP BY departments.dept_name;"
df_emp_avgSalary = pd.read_sql_query(emp_avgSalary, conexion)
df_emp_avgSalary.head(10)

          nombre_dpto  promedio_salario
0    Ciencia de Datos               NaN
1    Customer Service        58770.3665
2         Development        59478.9012
3             Finance        70489.3649
4     Human Resources        55574.8794
5           Marketing        71913.2000
6          Production        59605.4825
7  Quality Management        57251.2719
8            Research        59665.1817
9               Sales        80667.6058

## Preguntas para reflexionar:

1. Se podrán percatar de los retardos en la carga de datos.
2. Cuando que quieran cargar los sueldos, habrá problemas también.

## Ejercicios:

1. Cargar en un dataframa los datos de las consultas.

2. Elaborar un esquema conceptual para convertir este código a un modelo orientado a objetos.

3. Agregar al esquema el modelo de regresión lineal orientado a objetos dado en la [Clase 17](https://github.com/tirthajyoti/Machine-Learning-with-Python/blob/master/OOP_in_ML/Class_MyLinearRegression.ipynb).